package HelloWord1;

import java.util.Arrays;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.stream.Collectors;

/**
 *
 * @author zhenghuan
 * @date 2021/5/6
 */
public class TestZhuanHuan1 {
    public static final Map<Integer, String> colorStandard = new HashMap<>();

    static {
        colorStandard.put(0, "00");
        colorStandard.put(1, "33");
        colorStandard.put(2, "66");
        colorStandard.put(3, "99");
        colorStandard.put(4, "cc");
        colorStandard.put(5, "ff");
    }

    public static String changeRgb1(String str) {
        // 通过颜色标准key取出标准颜色
        String rs = colorStandard.get(Integer.valueOf(str.substring(0, 1)));
        String gs = colorStandard.get(Integer.valueOf(str.substring(1, 2)));
        String bs = colorStandard.get(Integer.valueOf(str.substring(2, 3)));
        String res = rs + gs + bs;
        return res;
    }

    public static void main(String[] args) {
        String str = "000 黑色\n" +
                "011 黑色\n" +
                "110 黑色\n" +
                "001 黑色\n" +
                "100 黑色\n" +
                "111 黑色\n" +
                "101 黑色\n" +
                "010 黑色\n" +
                "544 浅粉色\n" +
                "533 粉色\n" +
                "534 浅粉色\n" +
                "523 粉色\n" +
                "535 浅粉色\n" +
                "524 粉色\n" +
                "513 深粉色\n" +
                "525 粉色\n" +
                "514 深粉色\n" +
                "503 深粉色\n" +
                "515 深粉色\n" +
                "504 深粉色\n" +
                "554 白色\n" +
                "555 白色\n" +
                "545 白色\n" +
                "222 灰色\n" +
                "333 灰色\n" +
                "444 灰色\n" +
                "200 深红色\n" +
                "310 深红色\n" +
                "201 深红色\n" +
                "300 深红色\n" +
                "311 深红色\n" +
                "410 红色\n" +
                "520 浅红色\n" +
                "202 深红色\n" +
                "301 深红色\n" +
                "400 红色\n" +
                "411 红色\n" +
                "510 红色\n" +
                "312 浅红色\n" +
                "521 浅红色\n" +
                "401 红色\n" +
                "500 红色\n" +
                "511 红色\n" +
                "302 浅红色\n" +
                "412 浅红色\n" +
                "522 浅红色\n" +
                "501 红色\n" +
                "402 浅红色\n" +
                "512 浅红色\n" +
                "502 浅红色\n" +
                "440 浅橙色\n" +
                "430 深橙色\n" +
                "441 浅橙色\n" +
                "420 深橙色\n" +
                "431 深橙色\n" +
                "530 橙色\n" +
                "442 浅橙色\n" +
                "421 深橙色\n" +
                "432 深橙色\n" +
                "531 橙色\n" +
                "422 深橙色\n" +
                "532 橙色\n" +
                "550 黄色\n" +
                "540 深黄色\n" +
                "551 黄色\n" +
                "541 深黄色\n" +
                "552 浅黄色\n" +
                "542 深黄色\n" +
                "553 浅黄色\n" +
                "543 浅黄色\n" +
                "130 青色\n" +
                "230 深青色\n" +
                "054 青色\n" +
                "131 青色\n" +
                "033 深青色\n" +
                "231 深青色\n" +
                "055 青色\n" +
                "132 青色\n" +
                "154 浅青色\n" +
                "133 深青色\n" +
                "232 深青色\n" +
                "155 浅青色\n" +
                "233 深青色\n" +
                "255 浅青色\n" +
                "355 浅青色\n" +
                "455 浅青色\n" +
                "140 青色\n" +
                "141 青色\n" +
                "120 深青色\n" +
                "043 青色\n" +
                "142 青色\n" +
                "044 深青色\n" +
                "121 深青色\n" +
                "143 深青色\n" +
                "122 深青色\n" +
                "144 深青色\n" +
                "045 青色\n" +
                "225 深青色\n" +
                "050 绿色\n" +
                "150 绿色\n" +
                "051 绿色\n" +
                "030 深绿色\n" +
                "250 绿色\n" +
                "151 绿色\n" +
                "052 绿色\n" +
                "031 深绿色\n" +
                "251 绿色\n" +
                "152 绿色\n" +
                "053 绿色\n" +
                "350 浅绿色\n" +
                "032 深绿色\n" +
                "252 绿色\n" +
                "153 绿色\n" +
                "450 浅绿色\n" +
                "351 浅绿色\n" +
                "253 绿色\n" +
                "451 浅绿色\n" +
                "352 浅绿色\n" +
                "254 绿色\n" +
                "452 浅绿色\n" +
                "353 浅绿色\n" +
                "453 浅绿色\n" +
                "354 浅绿色\n" +
                "454 浅绿色\n" +
                "040 绿色\n" +
                "041 绿色\n" +
                "020 深绿色\n" +
                "240 绿色\n" +
                "042 绿色\n" +
                "340 深绿色\n" +
                "021 深绿色\n" +
                "241 绿色\n" +
                "341 深绿色\n" +
                "022 深绿色\n" +
                "242 绿色\n" +
                "342 深绿色\n" +
                "243 绿色\n" +
                "343 深绿色\n" +
                "012 深蓝色\n" +
                "034 浅蓝色\n" +
                "013 深蓝色\n" +
                "112 深蓝色\n" +
                "035 浅蓝色\n" +
                "134 浅蓝色\n" +
                "113 深蓝色\n" +
                "014 蓝色\n" +
                "135 浅蓝色\n" +
                "234 浅蓝色\n" +
                "015 蓝色\n" +
                "114 蓝色\n" +
                "235 浅蓝色\n" +
                "115 蓝色\n" +
                "023 深蓝色\n" +
                "002 深蓝色\n" +
                "024 蓝色\n" +
                "123 蓝色\n" +
                "244 浅蓝色\n" +
                "145 浅蓝色\n" +
                "003 深蓝色\n" +
                "102 深蓝色\n" +
                "025 蓝色\n" +
                "124 蓝色\n" +
                "344 浅蓝色\n" +
                "245 浅蓝色\n" +
                "223 浅蓝色\n" +
                "103 深蓝色\n" +
                "004 蓝色\n" +
                "125 蓝色\n" +
                "345 浅蓝色\n" +
                "224 浅蓝色\n" +
                "005 蓝色\n" +
                "104 蓝色\n" +
                "105 蓝色\n" +
                "212 深紫色\n" +
                "213 深紫色\n" +
                "334 浅紫色\n" +
                "214 深紫色\n" +
                "313 紫色\n" +
                "335 浅紫色\n" +
                "434 浅紫色\n" +
                "215 深紫色\n" +
                "314 紫色\n" +
                "413 紫色\n" +
                "435 浅紫色\n" +
                "315 紫色\n" +
                "414 紫色\n" +
                "415 紫色\n" +
                "323 浅紫色\n" +
                "203 深紫色\n" +
                "324 浅紫色\n" +
                "423 浅紫色\n" +
                "445 浅紫色\n" +
                "204 深紫色\n" +
                "303 紫色\n" +
                "325 浅紫色\n" +
                "424 浅紫色\n" +
                "205 深紫色\n" +
                "304 紫色\n" +
                "403 紫色\n" +
                "425 浅紫色\n" +
                "305 紫色\n" +
                "404 紫色\n" +
                "405 紫色\n" +
                "505 紫色\n" +
                "220 深棕色\n" +
                "330 浅棕色\n" +
                "210 深棕色\n" +
                "221 深棕色\n" +
                "320 棕色\n" +
                "331 浅棕色\n" +
                "211 深棕色\n" +
                "321 棕色\n" +
                "332 浅棕色\n" +
                "322 棕色\n" +
                "443 浅棕色\n" +
                "433 浅棕色 ";
        String[] str1 = str.split("\n");
        List<String> list = Arrays.asList(str1);
        List<String> list1 =
                list.stream().filter(item -> "浅棕色".equals(item.split(" ")[1])).map(
                        item -> changeRgb1(item.split(" ")[0])).collect(Collectors.toList());
        System.out.println(list1);
    }
}
